[{"name":"Call of Duty Vanguard", "id" : 1, "price" : "1000", "categories" :["First Person Shooter", "Action"], "image" : "/imagesForCards/codVanguardImage.jpg","bigImage": "/imagesforDetails/codVanguard0.jpg", "description":{"Campaign" : "The award-winning Call of Duty® series returns with Call of Duty®: Vanguard, in which players will experience influential battles of World War II as they fight for victory across the Eastern and Western Fronts of Europe, the Pacific, and North Africa.", "Multiplayer" : "Create and cement your legacy as Call of Duty’s signature Multiplayer experience launches an all-out assault on all fronts. Witness the rise of the Special Forces as players drop into new locales with authentic World War II loadouts.", "Zombies" : "Players will also be able to prove their mettle as they try to survive the relentless onslaught of the undead in a chilling new Zombies experience, developed by Treyarch Studios."}},
{"name":"Battlefield 5", "id" : 2, "price" : "800", "categories" :["First Person Shooter", "Action"], "image" : "/imagesForCards/battlefield5.jpg","bigImage": "/imagesforDetails/battlefield5Big.jpg", "description":{"Enter mankind’s greatest conflict with Battlefield™ V.": "The Battlefield series goes back to its roots in a never-before-seen portrayal of World War 2. Take on physical, all-out multiplayer with your squad in modes like the vast Grand Operations and the cooperative Combined Arms, or witness human drama set against global combat in the single player War Stories. As you fight in epic, unexpected locations across the globe, enjoy the richest and most immersive Battlefield yet. Now also includes Firestorm – Battle Royale, reimagined for Battlefield.", "Firestorm": "Battle Royale, reimagined for Battlefield. Dominate on the largest Battlefield map ever with epic weapons and combat vehicles as a deadly ring of fire closes in. Scavenge, fight, and survive to become the last squad standing.", "World War 2 as You’ve Never Seen It Before": "Take the fight to unexpected but crucial moments of the war, as Battlefield goes back to where it all began.", "64-Player Multiplayer in the Chaos of All-Out War":"Lead your Company in all-out multiplayer with new experiences like the massive Grand Operations mode. Take on classic modes like Conquest or squad up with friends in the cooperative Combined Arms.", "The Most Immersive Battlefield Yet":"Maneuver through the battlefield using a new soldier move set, fortifications, and mobile tools of destruction.", " Play Untold War Stories":"Witness human drama set against global combat in the single player War Stories. Ski down Norwegian mountains as you battle for control of nuclear weapon supply lines, join the frontline with the French colonial troops, or go behind enemy lines in North Africa with a band of misfits sent to create mayhem."}},
{"name":"Elden Ring", "id" : 3, "price" : "1000", "categories" :["RPG", "Action"], "image" : "/imagesForCards/eldenRing.jpg" ,"bigImage": "/imagesforDetails/eldenRingBig.jpg", "description" :{"The New Fantasy Action RPG": "Rise, Tarnished, and be guided by grace to brandish the power of the Elden Ring and become an Elden Lord in the Lands Between.", "A New Fantasy World": "Journey through the Lands Between, a new fantasy world created by Hidetaka Miyazaki, creator of the influential DARK SOULS video game series, and George R. R. Martin, author of The New York Times best-selling fantasy series, A Song of Ice and Fire.", "World Exploration in the Lands Between" :"ELDEN RING features vast fantastical landscapes and shadowy, complex dungeons that are connected seamlessly. Traverse the breathtaking world on foot or on horseback, alone or online with other players, and fully immerse yourself in the grassy plains, suffocating swamps, spiraling mountains, foreboding castles and other sites of grandeur on a scale never seen before in a FromSoftware title.", "Genre-Defining Gameplay" : "Create your character in FromSoftware's refined action-RPG and define your playstyle by experimenting with a wide variety of weapons, magical abilities, and skills found throughout the world. Charge into battle, pick off enemies one-by-one using stealth, or even call upon allies for aid. Many options are at your disposal as you decide how to approach exploration and combat. "}},
{"name":"Dying Light 2", "id" : 4, "price" : "900","categories" :["First Person Shooter", "Action"], "image" : "/imagesForCards/dyingLight2.jpg" , "bigImage": "/imagesforDetails/dyingLightBig.jpg", "description" : {"About this Game": "From the creators of hit titles Dead Island and Call of Juarez. Winner of over 50 industry awards and nominations. The game whose uncompromising approach to gameplay set new standards for first-person zombie games. Still supported with new content and free community events years after the release. Survive in a city beset by a zombie virus! Discover the hard choice you will have to make on your secret mission. Will loyalty to your superiors prove stronger than the will to save the survivors? The choice is yours…", "vast Open World": "Roam the city with unprecedented freedom and bask in its unique atmosphere. Use parkour to scale every building and reach remote areas.", "Creative Combat": "Engage in gory combat and discover limitless options to confront your enemies. Use the environment paired with various weapon types and abilities to gain an advantage.", "Day and Night Cycle":"Experience the dramatic shift in the world, as you change from a hunter to hunted at sundown. Face the coming threat or run away without wasting your time to look behind.", "4-Player Co-op": "Join forces with other players and raise your chances of survival in an exciting co-op mode. Tackle the story campaign together and take part in regularly scheduled community challenges."}},
{"name":"Lego Star Wars", "id" : 5, "price" : "700", "categories" :["Adventure", "Action"], "image" : "/imagesForCards/legoStarWars.jpg","bigImage": "/imagesforDetails/legoSWBig.jpg", "description": {"The Skywalker Saga": "The galaxy is yours with LEGO Star Wars: The Skywalker Saga! Play through all nine Star Wars saga films in a brand-new LEGO video game unlike any other. Experience fun-filled adventures, whimsical humor, and the freedom to fully immerse yourself in the LEGO Star Wars universe like never before.", "The Whole Saga": "Let fans get immersed in the Star Wars™ universe like never before with LEGO® Star Wars: The Skywalker Saga Deluxe Edition video game, featuring 9 films’ worth of content", "Play as your Favourite Character": "Over 300 playable characters including heroes like Luke Skywalker, Qui-Gon Jinn, Chewbacca, Leia Organa, and Poe Dameron or villains such as Darth Vader, Kylo Ren, Darth Maul and The Emperor", "Fly your Favourite Spaceship": "Whether on land or in space, more than 100 iconic vehicles are at the player’s disposal, including the Millennium Falcon, AT-AT walkers, First Order TIE fighters and Resistance X-wings", "Fly around the Galaxy": "Fly freely through the galaxy to discover many of the saga’s most legendary locations; including Tatooine, Hoth, Bespin and more"}},
{"name":"Metal Gear Solid 5: Ground Zeroes", "id" : 6, "price" : "500","categories" :["Action"], "image" : "/imagesForCards/metalGearSolid5GZ.jpg","bigImage": "/imagesforDetails/metalGearSolidGZBig.jpg", "description": {"Legend, Hero, Mercenary" : "World-renowned Kojima Productions brings the Metal Gear Solid franchise to Steam with METAL GEAR SOLID V: GROUND ZEROES. Play as the legendary hero Snake and infiltrate a Cuban military base to rescue the hostages. Can you make it out alive?", "Ground Zeroes": "MGSV: GZ gives core fans the opportunity to get a taste of the world-class production’s unparalleled visual presentation and gameplay before the release of the main game. It also provides an opportunity for gamers who have never played a Kojima Productions game, and veterans alike, to gain familiarity with the radical new game design and unparalleled style of presentation.", "Exclusive Missions": "Ground Zeroes boasts a central story mode and Side-Ops missions ranging from tactical action, aerial assaults and “covert” missions that will be sure to surprise.", "The Power Of Fox Engine": "Ground Zeroes showcases Kojima Productions’ stunning FOX Engine, a true next-generation game engine which revolutionizes the Metal Gear Solid experience.", "Unrestricted Stealth": "Imagine classic Metal Gear gameplay but with no restrictions or boundaries. Players use intelligence and cerebral strategy to sneak their way through entire missions, or go in all guns blazing. Each will have different effects on game consequences and advancement."}}]
